package com.example.alin.gogogo.bean;

import java.util.List;

/**
 * Created by Alin on 2016/7/19.
 */
public class VoiceGuide {

    /**
     * a : 0
     * b :
     * c :
     * d : {"rows":[{"comments":"【江南贡院导游解说词】\n      江南贡院是夫子庙地区主要建筑群之一，建于1168年，开始使用时是供县府学考试之用，明初这里称为乡试与会试的考场，到清朝时呀！考生应试的考核多达了2万多个，是中国古代最大的科举考场。\n       江南贡院在鼎盛时期，仅考试的号社就拥有二万零陆佰肆拾肆间加上官房，膳房、库房、杂役、兵房等数百间，占地超过了30万平方米，其规模之大，占地之广，居全国各省贡院之冠，创造了古代科举考场中中国之最，至隋朝创立了科举制度，到光绪帝废除科举制度，1300多年间，中国历史上产生了800余名状元，10万余名进士，上百万名举人，在这些考试当中也造就了许多有幸和不幸的名人，其中包括\u201c扬州八怪\u201d之一的郑燮，擅长诗书画三绝的风流才子唐伯虎，写就长篇神话小说《西游记》的 吴承恩，创作了《儒林外史》的吴敬梓，民族英雄林则徐等等\u2026\u2026\n      在江南贡院的大门前依次站立着唐伯虎、郑板桥、林则徐等这些贡院中历届高材生的铜像，让每一位游客一下子就能感受到这个素有\u201c南闱\u201d之称的江南贡院的名气。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/03/wKgBf1UuLLaAQwIQAAGQJ6EaLPA880_small.jpg?r=0.6058182411614954","landscapeId":"","name":"江南贡院（含中国科举博物馆）","shopId":"DP1020150402153803000101","size":"449","soundId":"20150506210010007602","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBflUkh5yABgmkAAcFpkDC-r0711.mp3"},{"comments":"【瞻园导游解说词】\n      瞻园位于南京市瞻园路128号，是南京保存最为完好的一组明代古典园林建筑群，与无锡寄畅园，苏州拙政园和留园并称为江南四大名园，瞻园景区由瞻园和瞻园太平天国历史博物馆两部分组成，是中山王徐达的府邸花园，始建于嘉庆年间。迄今已经有600多年的历史，明朝初年，朱元璋因为念功臣徐达\u201c未有宁居\u201d，特地给中山王徐达建成了这座府邸花园，经过徐氏七世、八世、九世三代人修缮与扩建，到明朝万历年间已经是初具规模了。清朝顺治二年及1645年该院成为了江南行省左布政使署。乾隆皇帝巡视江南，曾经驻跸此园，并御题\u201c瞻园\u201d匾额。\n太平天国历史博物馆是中国收藏保管、陈列宣传、调查研究太平天国文物史料的专题性博物馆，馆藏文物1657件，包括太平天国颁行的元刻本官署《钦定士阶条例》和《钦定军次实录》以及天王洪秀全批准颁行官书的\u201c旨\u201d准\u201c木印\u201d。 南归条碑（渡船规条碑）等传世珍品，专业性图书资料室藏有太平天国专著地方制8000于册。太平天国文物、遗迹底片5000余份。\n      瞻园景区布局典雅精致、宏伟壮观，陡峭峻拔的假山，闻名遐迩的北宋太湖石，清幽素雅的楼榭亭台，勾勒出一幅深渊回廊，奇峰叠葬、小桥流水、四季花香的美丽画卷。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBf1UwkVeAEY_HAABewx4O3rM820_small.jpg?r=0.8760439568855032","landscapeId":"","name":"瞻园（太平天国历史博物馆）","shopId":"DP1020150402165223000901","size":"554","soundId":"20150506210441008002","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgFUkjbuAKQNHAAirmH81Inc418.mp3"},{"comments":"【桃叶渡（吴敬梓故居）导游解说词】\n      远在石器时代，秦淮河流域就有人居住，明清时期秦淮河畔人烟密集，精粉楼台十分繁华，历史传说多的无以计数。\n      桃叶渡坐落在秦淮河内河与青溪河汇流处，渡口上有一座诗画舫，岸柳成荫，这里流传着古老的桃叶和桃根紧密的故事。\n       桃叶和桃根是东晋著名书法家王献之的心上人，王献之当年作诗《桃叶歌》表达过爱慕之情，当年王献之在渡口迎接过桃叶。这个古渡口因此得名，并名声大噪，桃叶临渡随成千古佳盛，和久传不衰的风流佳话，《桃叶歌》一直保存在明乐曲目中，是乐府的无声流韵，至今日本《明廷乐》曲目中还留有这首歌，吴敬梓和郑板桥也曾作诗桃叶渡，传颂这段爱情故事。桃叶渡为南京古名胜，金陵四十八景之一，桃叶渡边何芳静立，登船削骨渡口立有\u201c桃叶渡碑\u201d建有\u201c桃叶渡亭\u201d。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBflUwYreAcSgwAADnkFHiQxg352_small.jpg?r=0.30995237180719964","landscapeId":"","name":"桃叶渡（吴敬梓故居）","shopId":"DP1020150402163552000701","size":"343","soundId":"20150506205845007502","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUki2yACfxUAAVfgrcDQOQ492.mp3"},{"comments":"【东水关遗址公园导游解说词】\n      东水关是南京市文物保护单位，即今已有1000多年的历史，它位于通济门外，在龙蟠中路西侧，是秦淮河流入南京城的一个水关；初建于五代十国时期，明太祖朱元璋定都南京后，将它辟建为通济水关；水关为砖石结构，共有三层，每层有11券，共33券，券又被称为\u201c偃月洞\u201d，第一层由于当时战乱而毁坏，现存中层和下层，在古代上面两层是为了安置守城的将士和储藏物资的，最下面一层是为了调节内秦淮河水位和防洪的，中间的铁栅栏是为了防止敌军从水路偷袭的，因此这里是通水而不通航的；东水关将水关建筑与城墙建筑融为一体，在全国建筑史上显为一见，堪称一绝。\n      在六朝时期东水关是通向浙江、苏州方向的交通枢纽，南来北往的商古齐聚东水关，在些经商交易。现在东水关虽以不见往是的繁华、往日的人声鼎沸，但是确以其雄伟的气势屹立于十里内秦淮河的东端。\n     东水关距繁华的夫子庙仅半里之距，但却丝毫没有喧嚣的市井之噪，古朴的《秦淮胜境》牌坊，气度不凡，余怀草亭静静地立在东水关侧，亭中的石刻长卷《秦淮灯船歌》真能算的上是千古绝唱了；2001年东水关遗址公园建成，它有水闸、桥道、藏兵洞、城墙四部分组成，形成了一幅由秦淮石舫、石船流芳、临水平台、石桥夕照、船闸遗址等组成的美丽画卷。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/04/wKgBflUwPmiASNEMAAGTwwAS7oU005_small.jpg?r=0.7193421590737878","landscapeId":"","name":"东水关遗址公园","shopId":"DP1020150402164349000801","size":"538","soundId":"20150506201331006602","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBf1UkhuyAC7sZAAhop-NisFE188.mp3"},{"comments":"【夫子庙大成殿导游解说词】\n      夫子庙，又叫孔庙、文庙，是祭祀我国著名的大教育家、思想家孔子的地方。孔子在古代被人们尊称为孔夫子，所以他的庙宇也俗称\u201c夫子庙\u201d。由于儒学的正统地位，它的创始人孔子备受封建社会历朝历代的统治者和士子们的尊崇，祀奉他的孔庙遍布全国各地，有的地方还不只一个。夫子庙作为封建士子崇拜的场所，大多与教育设施布置在一起，也就是所谓的庙附于学，一般是在学宫的前面或一侧.历史上，南京城区的夫子庙曾有三处，一处在今市政府大院内，另一处在朝天宫。现在你所参观、游览是第三处，也是最有名气的一处。它是宋景佑元年从朝天宫迁来的，初为建康府学，元为集庆路学，明初为国学，后为应天府学，清迁出府学，改为江宁、上元两县学。咸丰年间毁于兵火，同治年间重建，抗战中为日军焚毁。现在所存的夫子庙为上世纪80年代初重建,它采用前庙后学，孔庙在前，学宫在后，后来设立的贡院被布置在学宫的左侧。因此，南京夫子庙比较完整的格局包括三部分，即孔庙、学宫、贡院。以大成殿为中心的南北中轴线及两侧的主要建筑和以明远楼为中心的江南贡院陈列馆成为夫子庙地区最主要的旅游观光点。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/81/wKgBf1V_xaCALwd6AAEuMwL_XYE097_small.jpg?r=0.12396213132888079","landscapeId":"","name":"夫子庙大成殿","shopId":"DP1020150402133822000202","size":"341","soundId":"20150918182557001101","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUc3x-AXcIDAAVW4DchMYg346.mp3"},{"comments":"【南京夫子庙导游解说词】\n      夫子庙，又叫孔庙、文庙，是祭祀我国著名的大教育家、思想家孔子的地方。孔子在古代被人们尊称为孔夫子，所以他的庙宇也俗称\u201c夫子庙\u201d。由于儒学的正统地位，它的创始人孔子备受封建社会历朝历代的统治者和士子们的尊崇，祀奉他的孔庙遍布全国各地，有的地方还不只一个。夫子庙作为封建士子崇拜的场所，大多与教育设施布置在一起，也就是所谓的庙附于学，一般是在学宫的前面或一侧.历史上，南京城区的夫子庙曾有三处，一处在今市政府大院内，另一处在朝天宫。现在你所参观、游览是第三处，也是最有名气的一处。它是宋景佑元年从朝天宫迁来的，初为建康府学，元为集庆路学，明初为国学，后为应天府学，清迁出府学，改为江宁、上元两县学。咸丰年间毁于兵火，同治年间重建，抗战中为日军焚毁。现在所存的夫子庙为上世纪80年代初重建,它采用前庙后学，孔庙在前，学宫在后，后来设立的贡院被布置在学宫的左侧。因此，南京夫子庙比较完整的格局包括三部分，即孔庙、学宫、贡院。以大成殿为中心的南北中轴线及两侧的主要建筑和以明远楼为中心的江南贡院陈列馆成为夫子庙地区最主要的旅游观光点。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/03/wKgBgFUvjs6AIClxAAEpKxGMVrs821_small.jpg?r=0.4094155240316557","landscapeId":"","name":"南京夫子庙","shopId":"DP1020150401180514000101","size":"341","soundId":"20150402111526000101","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUc3x-AXcIDAAVW4DchMYg346.mp3"},{"comments":"【秦大士故居导游解说词】\n       秦大士故居又名秦状元府，为清朝第四十三位状元秦大士的故宅，秦大士字鲁一，号鉴泉，士居涧林，是秦桧的后代，清乾隆17年中状元，官职侍讲学士，嘉庆年间任就明崇祯大学士何如宠故居遗址建了宅邸，秦大士故居府第颇广，有数路多进，房屋众多，号称九十九间半。厅堂在前，楼宅居后，侧有花园，旁建书房，布局合理，错落有致。\n       现尚存建筑为三路十进，占地面积2500平方米。西路四进，门厅面阔三间10.1米，进深8米，高6米。后三进为住宅楼，侧后方花园取宋代欧阳修\"瞻望玉堂，如在天上\"之意，取其为\"瞻园\"。园内有东山楼，秦大士字述廉，又植树柏、梓、桐、椐四竹于庭远，寓意为百子同居，院内至今还保留着古井一口，水质清澈，长年不枯，中路二进，大厅为建筑群中主体，面阔三间12米，进深8 米，高8.2米。大厅梁柱粗大，门窗隔扇雕花精美，具有明显清初建筑风格。东路三进均为楼房。\n       秦大士故居现存较完好房屋10间，行车厢房墙壁内砌有碑刻12块，上面刻秦状元正、草隶、撰四体书诗词。据说大士晚年喜欢绘画，尤其善于写竹，有事做写意花卉，生气盎然名重一时，并有蓬莱山桥集。人称秦大士的诗、书、画为\u201c三绝\u201d，中状元后更加精益求精，清著名书法家理论家包世成把秦大士列入冷品，在故居还保存着秦状元书写的碑刻，各具形神、赏心悦目为故居的参观亮点之一。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBflUwkJKAJNqrAADQ7tlQwp4129_small.jpg?r=0.11418721822529504","landscapeId":"","name":"秦大士 故居","shopId":"DP1020150519110945002002","size":"604","soundId":"20150529114158001002","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBf1UkiTeAUDCoAAlxJNPVml8300.mp3"},{"comments":"【乌衣巷导游解说词】\n      乌衣巷位于夫子庙西南数十米处，是一条幽静狭小的巷子，原来是东吴御林军营地，因为御林军的制服是玄色的，所以叫做乌衣巷。唐代大诗人刘禹锡的那首脍炙人口的诗：\u201c朱雀桥边野草花，乌衣巷口夕阳斜。旧时王谢堂前燕，飞入寻常百姓家。\u201d就是对此处的感叹。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBflUwle6AKmo_AABWEvi2imI876_small.jpg?r=0.7703551225559904","landscapeId":"","name":"乌衣 巷","shopId":"DP1020150402155817000401","size":"106","soundId":"20150512221418008602","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUej6SAcnrBAAGp0LcoDDg835.mp3"},{"comments":"【李香君故居导游解说词】\n      李香君故居坐落在夫子庙来燕桥南端，美丽的秦淮河畔，又称\u201c媚香楼\u201d。李香君是清初戏剧家孔尚任名著《桃花扇》中的秦淮名妓，秦淮八艳之一，是家喻户哓的我国古代罕有的光辉妇女形象，传说实有其人；她虽为一名青楼女子，但深明大义，善辩忠奸，具有高尚的名族气节，受到后人的敬仰。为纪念这位爱国名媛，特别在秦淮南岸修建了李香君故居，全面展现李香君当时生活的场景。\n       李香君故居是一座典型的清代河厅河房建筑，三进两院；院内丹桂、藤萝、蕉影婆娑，与玲珑的太湖石相映成趣、古风盎然。景点由\u201c秦淮八艳\u201d史料陈列馆和李香君故居展示等组成，内有秦淮八艳柳如是、马湘兰、陈圆圆、李香君、卞玉京、顾横波、寇白门、董小宛的生平展出，故居展示包括香君的卧室、书房、客厅和琴房。这是个独门的小院子，楼上楼下的古建筑很小巧，一如她的温婉； 周遭的环境极好，清幽淡雅，是最适宜淑女名媛的居所。\n       李香君是秦淮一颗璀璨明珠，后人有仿媚香楼遗址者经几代而不绝，她之所以受人仰慕，不在其花容月貌，而在于她有强烈的正义感、爱国心和高尚的情操，愤世嫉俗，显示出难能可贵的精神，出污泥而不染，濯清涟而不妖，眷怀故国；来到在秦淮河畔的故居，让人想起历史，勾起久远的回忆，李香君若九泉有知也足以告慰她那幽幽哀婉的名族魂。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/04/wKgBgFUwUZ-AVPITAAG_Sf8FvW0142_small.jpg?r=0.9493736352970601","landscapeId":"","name":"李香君故居（媚香楼）","shopId":"DP1020150402162544000601","size":"562","soundId":"20150506210305007902","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBflUkiJ6AKG2OAAjI-hJWJa4859.mp3"},{"comments":"【白鹭洲公园解说词】\n       白鹭洲公园是秦淮河风光带上一颗璀璨的明珠，它与南京构成了山水城自然人文风光，更是南京城中的一片绿洲；唐代著名诗人李白描述他所见到的白鹭洲\u201c三山半落青天外，二水中分白鹭洲\u201d；历史上白鹭洲是蓝天白云下青山碧水中的一座舟岛，空旷而秀美，随着河流的变化，元朝以后白鹭洲与陆地相连，但直至金朝它仍是一片美丽的境地，后来逐渐形成了沙洲圩遗迹，沙洲圩一直以盛产\u201c水八鲜\u201d即鱼、菱、藕、茭瓜、茨菰、鸡头果、莲蓬和水芹而享誉南京。\n       白鹭洲公园位于夫子庙东南部，原为明开国元勋徐达的花园，称中山园\u201c东园\u201d，由于独具野趣，一直是文人雅集的地方，民国正式辟为\u201c公园\u201d。由于南京人对白鹭洲挥之不去的情节，将这城中公园称为\u201c白鹭洲公园\u201d。现在的白鹭洲公园以林为自然风光，依托独有的人文资源，成为生态历史文化景观园；白鹭洲公园占地200亩，由50多亩湖水面积，有\u201c春水垂杨，辛夷挺秀\u201d十个著名景点以及鹭洲春日四景、水街七雅以\u201c琴棋书画歌舞茶\u201d为特色，是历史文化核心景区。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/03/wKgBflUuDIOAMJsCAAU7ftvpX1s661_small.jpg?r=0.6881529591820188","landscapeId":"","name":"南京白鹭洲公园","shopId":"DP1020150402155114000301","size":"443","soundId":"20150506210056007702","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBf1UkiEqAQDNxAAbunzHH4Kk543.mp3"}],"total":17}
     * e : 0
     */

    private String a;
    private String b;
    private String c;
    /**
     * rows : [{"comments":"【江南贡院导游解说词】\n      江南贡院是夫子庙地区主要建筑群之一，建于1168年，开始使用时是供县府学考试之用，明初这里称为乡试与会试的考场，到清朝时呀！考生应试的考核多达了2万多个，是中国古代最大的科举考场。\n       江南贡院在鼎盛时期，仅考试的号社就拥有二万零陆佰肆拾肆间加上官房，膳房、库房、杂役、兵房等数百间，占地超过了30万平方米，其规模之大，占地之广，居全国各省贡院之冠，创造了古代科举考场中中国之最，至隋朝创立了科举制度，到光绪帝废除科举制度，1300多年间，中国历史上产生了800余名状元，10万余名进士，上百万名举人，在这些考试当中也造就了许多有幸和不幸的名人，其中包括\u201c扬州八怪\u201d之一的郑燮，擅长诗书画三绝的风流才子唐伯虎，写就长篇神话小说《西游记》的 吴承恩，创作了《儒林外史》的吴敬梓，民族英雄林则徐等等\u2026\u2026\n      在江南贡院的大门前依次站立着唐伯虎、郑板桥、林则徐等这些贡院中历届高材生的铜像，让每一位游客一下子就能感受到这个素有\u201c南闱\u201d之称的江南贡院的名气。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/03/wKgBf1UuLLaAQwIQAAGQJ6EaLPA880_small.jpg?r=0.6058182411614954","landscapeId":"","name":"江南贡院（含中国科举博物馆）","shopId":"DP1020150402153803000101","size":"449","soundId":"20150506210010007602","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBflUkh5yABgmkAAcFpkDC-r0711.mp3"},{"comments":"【瞻园导游解说词】\n      瞻园位于南京市瞻园路128号，是南京保存最为完好的一组明代古典园林建筑群，与无锡寄畅园，苏州拙政园和留园并称为江南四大名园，瞻园景区由瞻园和瞻园太平天国历史博物馆两部分组成，是中山王徐达的府邸花园，始建于嘉庆年间。迄今已经有600多年的历史，明朝初年，朱元璋因为念功臣徐达\u201c未有宁居\u201d，特地给中山王徐达建成了这座府邸花园，经过徐氏七世、八世、九世三代人修缮与扩建，到明朝万历年间已经是初具规模了。清朝顺治二年及1645年该院成为了江南行省左布政使署。乾隆皇帝巡视江南，曾经驻跸此园，并御题\u201c瞻园\u201d匾额。\n太平天国历史博物馆是中国收藏保管、陈列宣传、调查研究太平天国文物史料的专题性博物馆，馆藏文物1657件，包括太平天国颁行的元刻本官署《钦定士阶条例》和《钦定军次实录》以及天王洪秀全批准颁行官书的\u201c旨\u201d准\u201c木印\u201d。 南归条碑（渡船规条碑）等传世珍品，专业性图书资料室藏有太平天国专著地方制8000于册。太平天国文物、遗迹底片5000余份。\n      瞻园景区布局典雅精致、宏伟壮观，陡峭峻拔的假山，闻名遐迩的北宋太湖石，清幽素雅的楼榭亭台，勾勒出一幅深渊回廊，奇峰叠葬、小桥流水、四季花香的美丽画卷。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBf1UwkVeAEY_HAABewx4O3rM820_small.jpg?r=0.8760439568855032","landscapeId":"","name":"瞻园（太平天国历史博物馆）","shopId":"DP1020150402165223000901","size":"554","soundId":"20150506210441008002","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgFUkjbuAKQNHAAirmH81Inc418.mp3"},{"comments":"【桃叶渡（吴敬梓故居）导游解说词】\n      远在石器时代，秦淮河流域就有人居住，明清时期秦淮河畔人烟密集，精粉楼台十分繁华，历史传说多的无以计数。\n      桃叶渡坐落在秦淮河内河与青溪河汇流处，渡口上有一座诗画舫，岸柳成荫，这里流传着古老的桃叶和桃根紧密的故事。\n       桃叶和桃根是东晋著名书法家王献之的心上人，王献之当年作诗《桃叶歌》表达过爱慕之情，当年王献之在渡口迎接过桃叶。这个古渡口因此得名，并名声大噪，桃叶临渡随成千古佳盛，和久传不衰的风流佳话，《桃叶歌》一直保存在明乐曲目中，是乐府的无声流韵，至今日本《明廷乐》曲目中还留有这首歌，吴敬梓和郑板桥也曾作诗桃叶渡，传颂这段爱情故事。桃叶渡为南京古名胜，金陵四十八景之一，桃叶渡边何芳静立，登船削骨渡口立有\u201c桃叶渡碑\u201d建有\u201c桃叶渡亭\u201d。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBflUwYreAcSgwAADnkFHiQxg352_small.jpg?r=0.30995237180719964","landscapeId":"","name":"桃叶渡（吴敬梓故居）","shopId":"DP1020150402163552000701","size":"343","soundId":"20150506205845007502","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUki2yACfxUAAVfgrcDQOQ492.mp3"},{"comments":"【东水关遗址公园导游解说词】\n      东水关是南京市文物保护单位，即今已有1000多年的历史，它位于通济门外，在龙蟠中路西侧，是秦淮河流入南京城的一个水关；初建于五代十国时期，明太祖朱元璋定都南京后，将它辟建为通济水关；水关为砖石结构，共有三层，每层有11券，共33券，券又被称为\u201c偃月洞\u201d，第一层由于当时战乱而毁坏，现存中层和下层，在古代上面两层是为了安置守城的将士和储藏物资的，最下面一层是为了调节内秦淮河水位和防洪的，中间的铁栅栏是为了防止敌军从水路偷袭的，因此这里是通水而不通航的；东水关将水关建筑与城墙建筑融为一体，在全国建筑史上显为一见，堪称一绝。\n      在六朝时期东水关是通向浙江、苏州方向的交通枢纽，南来北往的商古齐聚东水关，在些经商交易。现在东水关虽以不见往是的繁华、往日的人声鼎沸，但是确以其雄伟的气势屹立于十里内秦淮河的东端。\n     东水关距繁华的夫子庙仅半里之距，但却丝毫没有喧嚣的市井之噪，古朴的《秦淮胜境》牌坊，气度不凡，余怀草亭静静地立在东水关侧，亭中的石刻长卷《秦淮灯船歌》真能算的上是千古绝唱了；2001年东水关遗址公园建成，它有水闸、桥道、藏兵洞、城墙四部分组成，形成了一幅由秦淮石舫、石船流芳、临水平台、石桥夕照、船闸遗址等组成的美丽画卷。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/04/wKgBflUwPmiASNEMAAGTwwAS7oU005_small.jpg?r=0.7193421590737878","landscapeId":"","name":"东水关遗址公园","shopId":"DP1020150402164349000801","size":"538","soundId":"20150506201331006602","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBf1UkhuyAC7sZAAhop-NisFE188.mp3"},{"comments":"【夫子庙大成殿导游解说词】\n      夫子庙，又叫孔庙、文庙，是祭祀我国著名的大教育家、思想家孔子的地方。孔子在古代被人们尊称为孔夫子，所以他的庙宇也俗称\u201c夫子庙\u201d。由于儒学的正统地位，它的创始人孔子备受封建社会历朝历代的统治者和士子们的尊崇，祀奉他的孔庙遍布全国各地，有的地方还不只一个。夫子庙作为封建士子崇拜的场所，大多与教育设施布置在一起，也就是所谓的庙附于学，一般是在学宫的前面或一侧.历史上，南京城区的夫子庙曾有三处，一处在今市政府大院内，另一处在朝天宫。现在你所参观、游览是第三处，也是最有名气的一处。它是宋景佑元年从朝天宫迁来的，初为建康府学，元为集庆路学，明初为国学，后为应天府学，清迁出府学，改为江宁、上元两县学。咸丰年间毁于兵火，同治年间重建，抗战中为日军焚毁。现在所存的夫子庙为上世纪80年代初重建,它采用前庙后学，孔庙在前，学宫在后，后来设立的贡院被布置在学宫的左侧。因此，南京夫子庙比较完整的格局包括三部分，即孔庙、学宫、贡院。以大成殿为中心的南北中轴线及两侧的主要建筑和以明远楼为中心的江南贡院陈列馆成为夫子庙地区最主要的旅游观光点。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/81/wKgBf1V_xaCALwd6AAEuMwL_XYE097_small.jpg?r=0.12396213132888079","landscapeId":"","name":"夫子庙大成殿","shopId":"DP1020150402133822000202","size":"341","soundId":"20150918182557001101","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUc3x-AXcIDAAVW4DchMYg346.mp3"},{"comments":"【南京夫子庙导游解说词】\n      夫子庙，又叫孔庙、文庙，是祭祀我国著名的大教育家、思想家孔子的地方。孔子在古代被人们尊称为孔夫子，所以他的庙宇也俗称\u201c夫子庙\u201d。由于儒学的正统地位，它的创始人孔子备受封建社会历朝历代的统治者和士子们的尊崇，祀奉他的孔庙遍布全国各地，有的地方还不只一个。夫子庙作为封建士子崇拜的场所，大多与教育设施布置在一起，也就是所谓的庙附于学，一般是在学宫的前面或一侧.历史上，南京城区的夫子庙曾有三处，一处在今市政府大院内，另一处在朝天宫。现在你所参观、游览是第三处，也是最有名气的一处。它是宋景佑元年从朝天宫迁来的，初为建康府学，元为集庆路学，明初为国学，后为应天府学，清迁出府学，改为江宁、上元两县学。咸丰年间毁于兵火，同治年间重建，抗战中为日军焚毁。现在所存的夫子庙为上世纪80年代初重建,它采用前庙后学，孔庙在前，学宫在后，后来设立的贡院被布置在学宫的左侧。因此，南京夫子庙比较完整的格局包括三部分，即孔庙、学宫、贡院。以大成殿为中心的南北中轴线及两侧的主要建筑和以明远楼为中心的江南贡院陈列馆成为夫子庙地区最主要的旅游观光点。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/03/wKgBgFUvjs6AIClxAAEpKxGMVrs821_small.jpg?r=0.4094155240316557","landscapeId":"","name":"南京夫子庙","shopId":"DP1020150401180514000101","size":"341","soundId":"20150402111526000101","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUc3x-AXcIDAAVW4DchMYg346.mp3"},{"comments":"【秦大士故居导游解说词】\n       秦大士故居又名秦状元府，为清朝第四十三位状元秦大士的故宅，秦大士字鲁一，号鉴泉，士居涧林，是秦桧的后代，清乾隆17年中状元，官职侍讲学士，嘉庆年间任就明崇祯大学士何如宠故居遗址建了宅邸，秦大士故居府第颇广，有数路多进，房屋众多，号称九十九间半。厅堂在前，楼宅居后，侧有花园，旁建书房，布局合理，错落有致。\n       现尚存建筑为三路十进，占地面积2500平方米。西路四进，门厅面阔三间10.1米，进深8米，高6米。后三进为住宅楼，侧后方花园取宋代欧阳修\"瞻望玉堂，如在天上\"之意，取其为\"瞻园\"。园内有东山楼，秦大士字述廉，又植树柏、梓、桐、椐四竹于庭远，寓意为百子同居，院内至今还保留着古井一口，水质清澈，长年不枯，中路二进，大厅为建筑群中主体，面阔三间12米，进深8 米，高8.2米。大厅梁柱粗大，门窗隔扇雕花精美，具有明显清初建筑风格。东路三进均为楼房。\n       秦大士故居现存较完好房屋10间，行车厢房墙壁内砌有碑刻12块，上面刻秦状元正、草隶、撰四体书诗词。据说大士晚年喜欢绘画，尤其善于写竹，有事做写意花卉，生气盎然名重一时，并有蓬莱山桥集。人称秦大士的诗、书、画为\u201c三绝\u201d，中状元后更加精益求精，清著名书法家理论家包世成把秦大士列入冷品，在故居还保存着秦状元书写的碑刻，各具形神、赏心悦目为故居的参观亮点之一。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBflUwkJKAJNqrAADQ7tlQwp4129_small.jpg?r=0.11418721822529504","landscapeId":"","name":"秦大士 故居","shopId":"DP1020150519110945002002","size":"604","soundId":"20150529114158001002","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBf1UkiTeAUDCoAAlxJNPVml8300.mp3"},{"comments":"【乌衣巷导游解说词】\n      乌衣巷位于夫子庙西南数十米处，是一条幽静狭小的巷子，原来是东吴御林军营地，因为御林军的制服是玄色的，所以叫做乌衣巷。唐代大诗人刘禹锡的那首脍炙人口的诗：\u201c朱雀桥边野草花，乌衣巷口夕阳斜。旧时王谢堂前燕，飞入寻常百姓家。\u201d就是对此处的感叹。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/05/wKgBflUwle6AKmo_AABWEvi2imI876_small.jpg?r=0.7703551225559904","landscapeId":"","name":"乌衣 巷","shopId":"DP1020150402155817000401","size":"106","soundId":"20150512221418008602","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBgVUej6SAcnrBAAGp0LcoDDg835.mp3"},{"comments":"【李香君故居导游解说词】\n      李香君故居坐落在夫子庙来燕桥南端，美丽的秦淮河畔，又称\u201c媚香楼\u201d。李香君是清初戏剧家孔尚任名著《桃花扇》中的秦淮名妓，秦淮八艳之一，是家喻户哓的我国古代罕有的光辉妇女形象，传说实有其人；她虽为一名青楼女子，但深明大义，善辩忠奸，具有高尚的名族气节，受到后人的敬仰。为纪念这位爱国名媛，特别在秦淮南岸修建了李香君故居，全面展现李香君当时生活的场景。\n       李香君故居是一座典型的清代河厅河房建筑，三进两院；院内丹桂、藤萝、蕉影婆娑，与玲珑的太湖石相映成趣、古风盎然。景点由\u201c秦淮八艳\u201d史料陈列馆和李香君故居展示等组成，内有秦淮八艳柳如是、马湘兰、陈圆圆、李香君、卞玉京、顾横波、寇白门、董小宛的生平展出，故居展示包括香君的卧室、书房、客厅和琴房。这是个独门的小院子，楼上楼下的古建筑很小巧，一如她的温婉； 周遭的环境极好，清幽淡雅，是最适宜淑女名媛的居所。\n       李香君是秦淮一颗璀璨明珠，后人有仿媚香楼遗址者经几代而不绝，她之所以受人仰慕，不在其花容月貌，而在于她有强烈的正义感、爱国心和高尚的情操，愤世嫉俗，显示出难能可贵的精神，出污泥而不染，濯清涟而不妖，眷怀故国；来到在秦淮河畔的故居，让人想起历史，勾起久远的回忆，李香君若九泉有知也足以告慰她那幽幽哀婉的名族魂。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/04/wKgBgFUwUZ-AVPITAAG_Sf8FvW0142_small.jpg?r=0.9493736352970601","landscapeId":"","name":"李香君故居（媚香楼）","shopId":"DP1020150402162544000601","size":"562","soundId":"20150506210305007902","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBflUkiJ6AKG2OAAjI-hJWJa4859.mp3"},{"comments":"【白鹭洲公园解说词】\n       白鹭洲公园是秦淮河风光带上一颗璀璨的明珠，它与南京构成了山水城自然人文风光，更是南京城中的一片绿洲；唐代著名诗人李白描述他所见到的白鹭洲\u201c三山半落青天外，二水中分白鹭洲\u201d；历史上白鹭洲是蓝天白云下青山碧水中的一座舟岛，空旷而秀美，随着河流的变化，元朝以后白鹭洲与陆地相连，但直至金朝它仍是一片美丽的境地，后来逐渐形成了沙洲圩遗迹，沙洲圩一直以盛产\u201c水八鲜\u201d即鱼、菱、藕、茭瓜、茨菰、鸡头果、莲蓬和水芹而享誉南京。\n       白鹭洲公园位于夫子庙东南部，原为明开国元勋徐达的花园，称中山园\u201c东园\u201d，由于独具野趣，一直是文人雅集的地方，民国正式辟为\u201c公园\u201d。由于南京人对白鹭洲挥之不去的情节，将这城中公园称为\u201c白鹭洲公园\u201d。现在的白鹭洲公园以林为自然风光，依托独有的人文资源，成为生态历史文化景观园；白鹭洲公园占地200亩，由50多亩湖水面积，有\u201c春水垂杨，辛夷挺秀\u201d十个著名景点以及鹭洲春日四景、水街七雅以\u201c琴棋书画歌舞茶\u201d为特色，是历史文化核心景区。","distance":">5km","img":"http://file.zhfzm.com/zouyizou_bss/group1/M00/00/03/wKgBflUuDIOAMJsCAAU7ftvpX1s661_small.jpg?r=0.6881529591820188","landscapeId":"","name":"南京白鹭洲公园","shopId":"DP1020150402155114000301","size":"443","soundId":"20150506210056007702","url":"http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBf1UkiEqAQDNxAAbunzHH4Kk543.mp3"}]
     * total : 17
     */

    private DBean d;
    private String e;

    public String getA() {
        return a;
    }

    public void setA(String a) {
        this.a = a;
    }

    public String getB() {
        return b;
    }

    public void setB(String b) {
        this.b = b;
    }

    public String getC() {
        return c;
    }

    public void setC(String c) {
        this.c = c;
    }

    public DBean getD() {
        return d;
    }

    public void setD(DBean d) {
        this.d = d;
    }

    public String getE() {
        return e;
    }

    public void setE(String e) {
        this.e = e;
    }

    public static class DBean {
        private int total;
        /**
         * comments : 【江南贡院导游解说词】
         江南贡院是夫子庙地区主要建筑群之一，建于1168年，开始使用时是供县府学考试之用，明初这里称为乡试与会试的考场，到清朝时呀！考生应试的考核多达了2万多个，是中国古代最大的科举考场。
         江南贡院在鼎盛时期，仅考试的号社就拥有二万零陆佰肆拾肆间加上官房，膳房、库房、杂役、兵房等数百间，占地超过了30万平方米，其规模之大，占地之广，居全国各省贡院之冠，创造了古代科举考场中中国之最，至隋朝创立了科举制度，到光绪帝废除科举制度，1300多年间，中国历史上产生了800余名状元，10万余名进士，上百万名举人，在这些考试当中也造就了许多有幸和不幸的名人，其中包括“扬州八怪”之一的郑燮，擅长诗书画三绝的风流才子唐伯虎，写就长篇神话小说《西游记》的 吴承恩，创作了《儒林外史》的吴敬梓，民族英雄林则徐等等……
         在江南贡院的大门前依次站立着唐伯虎、郑板桥、林则徐等这些贡院中历届高材生的铜像，让每一位游客一下子就能感受到这个素有“南闱”之称的江南贡院的名气。
         * distance : >5km
         * img : http://file.zhfzm.com/zouyizou_bss/group1/M00/00/03/wKgBf1UuLLaAQwIQAAGQJ6EaLPA880_small.jpg?r=0.6058182411614954
         * landscapeId :
         * name : 江南贡院（含中国科举博物馆）
         * shopId : DP1020150402153803000101
         * size : 449
         * soundId : 20150506210010007602
         * url : http://file.zhfzm.com/zouyizou_bss/group2/M00/00/00/wKgBflUkh5yABgmkAAcFpkDC-r0711.mp3
         */

        private List<RowsBean> rows;

        public int getTotal() {
            return total;
        }

        public void setTotal(int total) {
            this.total = total;
        }

        public List<RowsBean> getRows() {
            return rows;
        }

        public void setRows(List<RowsBean> rows) {
            this.rows = rows;
        }

        public static class RowsBean {
            private String comments;
            private String distance;
            private String img;
            private String landscapeId;
            private String name;
            private String shopId;
            private String size;
            private String soundId;
            private String url;

            public String getComments() {
                return comments;
            }

            public void setComments(String comments) {
                this.comments = comments;
            }

            public String getDistance() {
                return distance;
            }

            public void setDistance(String distance) {
                this.distance = distance;
            }

            public String getImg() {
                return img;
            }

            public void setImg(String img) {
                this.img = img;
            }

            public String getLandscapeId() {
                return landscapeId;
            }

            public void setLandscapeId(String landscapeId) {
                this.landscapeId = landscapeId;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public String getShopId() {
                return shopId;
            }

            public void setShopId(String shopId) {
                this.shopId = shopId;
            }

            public String getSize() {
                return size;
            }

            public void setSize(String size) {
                this.size = size;
            }

            public String getSoundId() {
                return soundId;
            }

            public void setSoundId(String soundId) {
                this.soundId = soundId;
            }

            public String getUrl() {
                return url;
            }

            public void setUrl(String url) {
                this.url = url;
            }
        }
    }
}
